background-processing/ExampleApp/app/controllers/functions_controller.rb

  def index
    @functions = Function.all
---
SELECT "functions".* FROM "functions"

  def create
    @function = Function.new(function_params)

    respond_to do |format|
      if @function.save
---
INSERT INTO "functions" ("name", "date_entry", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Vargas Juan Antonio"], ["date_entry", "2018-03-31"], ["created_at", "2018-03-20 11:57:30.041457"], ["updated_at", "2018-03-20 11:57:30.041457"]]

    def set_function
      @function = Function.find(params[:id])
---
SELECT  "functions".* FROM "functions" WHERE "functions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]